// 1. Є такий код:
// Допишіть код, щоб в консолі браузера з'явилися рядки, які написані в коментарях, оперуючи при цьому змінними х і у.
function task01 () {
  let x = 1
  let y = 2

  let res1 = `${x}` + `${y}` // Допишіть код, необхідно використовувати змінні x і y
  console.log(res1) // "12"
  console.log(typeof res1) // "string"

  let res2 = x !== y // Допишіть код, необхідно використовувати змінні x і y
  console.log(res2) // "true2"
  console.log(typeof res2) // "string"

  let res3 = Boolean(x + y) // Допишіть код, необхідно використовувати змінні x і y
  console.log(res3) // true
  console.log(typeof res3) // "boolean"

  let res4 = x * `+ ${y}` // Допишіть код, необхідно використовувати змінні x і y // NaN
  console.log(typeof res4) // "number"
}

// 2. Користувач вводить число (використовуйте prompt ()). Необхідно перевірити чи є введене число
// 	a) парним додатним;
// 	b) кратним числу 7.
// Результат перевірки вивести в консоль.
function task02 () {
  let x = prompt('Enter a number:')
  console.log(`Is even: ${x % 2 === 0}`)
  console.log(`Is divided by 7: ${x % 7 === 0}`)
}

// 3. Створіть порожній масив;
function task03 () {
  // 1) У перший елемент масиву запишіть будь-яке число;
  // 2) У другий елемент масиву запишіть будь-який рядок;
  // 3) У третій елемент масиву запишіть будь-яке логічне значення;
  // 4) У четвертий елемент масиву запишіть значення null;
  const arr = []
  arr[0] = Math.floor(Math.random() * 10)
  arr[1] = 'lorem'
  arr[2] = true
  arr[3] = null
  // 5) Виведіть на екран число елементів, яке зберігається в масиві;
  console.log(arr.length)
  // 6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
  arr[4] = prompt('Enter something:')
  // 7) Виведіть на екран п'ятий елемент масиву.
  console.log(arr[4])
  // 8) Видаліть 1-ий елемент масиву і виведіть масив на екран.
  console.log(arr)
  arr.shift()
  console.log(arr)
}

// 4. Напишіть програму, яка об’єднує всі наявні елементи масиву в стрічку і розділяє їх символом “*”.
// Початковий масив:
// let cities = ["Rome", "Lviv", "Warsaw"];
// Результат:
// "Rome*Lviv*Warsaw"

// 5. Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”,

// 6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
// Необхідно
// 	a) визначити і вивести в консоль площу трикутника
// 	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
// Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).

// 7. Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
// В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.
